In [1]:
pip install numpy pandas

Requirement already satisfied: numpy in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (2.2.6)
Requirement already satisfied: pandas in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\abhishek\appdata\roaming\python\python310\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\abhishek\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.3 is available.
You should consider upgrading via the 'c:\Users\Abhishek\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import numpy as np
import pandas as pd

In [3]:

data = [
    [1, "John", 28, 50000, "2018-01-15", "Sales"],
    [2, "Alice", np.nan, 62000, "2019-03-22", "HR"],
    [3, "Bob", 35, 58000, "2017-07-30", "Sales"],
    [4, "John", 28, 50000, "2018-01-15", "Sales"],
    [5, "Eve", 29, np.nan, "2018/05/12", "Finance"],
    [6, "Charlie", 25, 45000, "2019-12-01", "IT"],
    [7, np.nan, 32, 61000, "2020-06-20", "Sales"],
    [8, "Dave", np.nan, 52000, "2021-02-14", np.nan],
    [9, "Alice", "Thirty", 62000, "2019-03-22", "HR"],
    [10, "Eve", 29, 1000000, "2018-05-12", "Finance"],
    [11, "Frank", 40, np.nan, "2016-08-19", "IT"],
    [12, "Grace", 27, 47000, "2022-09-25", "Support"]
]

# Convert to ndarray (dtype=object because of mixed data types)
arr = np.array(data, dtype=object)

In [4]:
print(arr)

[[1 'John' 28 50000 '2018-01-15' 'Sales']
 [2 'Alice' nan 62000 '2019-03-22' 'HR']
 [3 'Bob' 35 58000 '2017-07-30' 'Sales']
 [4 'John' 28 50000 '2018-01-15' 'Sales']
 [5 'Eve' 29 nan '2018/05/12' 'Finance']
 [6 'Charlie' 25 45000 '2019-12-01' 'IT']
 [7 nan 32 61000 '2020-06-20' 'Sales']
 [8 'Dave' nan 52000 '2021-02-14' nan]
 [9 'Alice' 'Thirty' 62000 '2019-03-22' 'HR']
 [10 'Eve' 29 1000000 '2018-05-12' 'Finance']
 [11 'Frank' 40 nan '2016-08-19' 'IT']
 [12 'Grace' 27 47000 '2022-09-25' 'Support']]

In [5]:
df=pd.read_csv("messy_data.csv")
print(df)

    ID     Name     Age     Salary Joining_Date Department
0    1     John      28    50000.0   2018-01-15      Sales
1    2    Alice     NaN    62000.0   2019-03-22         HR
2    3      Bob      35    58000.0   2017-07-30      Sales
3    4     John      28    50000.0   2018-01-15      Sales
4    5      Eve      29        NaN   2018/05/12    Finance
5    6  Charlie      25    45000.0   2019-12-01         IT
6    7      NaN      32    61000.0   2020-06-20      Sales
7    8     Dave     NaN    52000.0   2021-02-14        NaN
8    9    Alice  Thirty    62000.0   2019-03-22         HR
9   10      Eve      29  1000000.0   2018-05-12    Finance
10  11    Frank      40        NaN   2016-08-19         IT
11  12    Grace      27    47000.0   2022-09-25    Support

In [6]:
type(data)

list

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
# arr=np.array([[1,2,3,4],[5,6,7,8,]])

In [9]:
arr.shape

(12, 6)

In [10]:
arr.dtype

dtype('O')

In [11]:
type(arr)

numpy.ndarray

In [12]:
arr.size

72

In [13]:
arr.ndim

2

In [14]:
df.isnull().sum()

ID              0
Name            1
Age             2
Salary          2
Joining_Date    0
Department      1
dtype: int64

In [15]:
df.duplicated().sum()

np.int64(0)

In [16]:
df.isnull().sum()/df.shape[0]*100

ID               0.000000
Name             8.333333
Age             16.666667
Salary          16.666667
Joining_Date     0.000000
Department       8.333333
dtype: float64

In [17]:
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

C:\Users\Abhishek\AppData\Local\Temp\ipykernel_7660\2644856927.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)

In [18]:
df

    ID     Name     Age     Salary Joining_Date Department
0    1     John      28    50000.0   2018-01-15      Sales
1    2    Alice     NaN    62000.0   2019-03-22         HR
2    3      Bob      35    58000.0   2017-07-30      Sales
3    4     John      28    50000.0   2018-01-15      Sales
4    5      Eve      29   148700.0   2018/05/12    Finance
5    6  Charlie      25    45000.0   2019-12-01         IT
6    7      NaN      32    61000.0   2020-06-20      Sales
7    8     Dave     NaN    52000.0   2021-02-14        NaN
8    9    Alice  Thirty    62000.0   2019-03-22         HR
9   10      Eve      29  1000000.0   2018-05-12    Finance
10  11    Frank      40   148700.0   2016-08-19         IT
11  12    Grace      27    47000.0   2022-09-25    Support

In [19]:
# df.fillna(df.mean(),inplace=True)

In [20]:
df.replace([np.inf,-np.inf],np.nan, inplace=True)

In [21]:
df["Age"].loc[8] = 30

C:\Users\Abhishek\AppData\Local\Temp\ipykernel_7660\2221808755.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Age"].loc[8] = 30
C:\Users\Abhishek\AppData\Local\Temp\ipykernel_7660\2221808755.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"].loc[8] = 30

In [22]:
df['Age'] = pd.to_numeric(df['Age'],errors="coerce")

In [23]:
df['Age'].fillna(df["Age"].mean(),inplace=True)

C:\Users\Abhishek\AppData\Local\Temp\ipykernel_7660\2703313926.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df["Age"].mean(),inplace=True)

In [24]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
3    4     John  28.0    50000.0   2018-01-15      Sales
4    5      Eve  29.0   148700.0   2018/05/12    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
6    7      NaN  32.0    61000.0   2020-06-20      Sales
7    8     Dave  30.3    52000.0   2021-02-14        NaN
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [25]:
df['Joining_Date']=pd.to_datetime(df['Joining_Date'],errors='coerce')

In [26]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
3    4     John  28.0    50000.0   2018-01-15      Sales
4    5      Eve  29.0   148700.0          NaT    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
6    7      NaN  32.0    61000.0   2020-06-20      Sales
7    8     Dave  30.3    52000.0   2021-02-14        NaN
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [27]:
df['Joining_Date'].isna().sum()

np.int64(1)

In [28]:
df['Joining_Date']=df['Joining_Date'].fillna(pd.to_datetime('2018-5-12'))

In [29]:
median_date = df["Joining_Date"].median()
df["Joining_Date"].fillna(median_date, inplace=True)

C:\Users\Abhishek\AppData\Local\Temp\ipykernel_7660\3912277444.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Joining_Date"].fillna(median_date, inplace=True)

In [30]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
3    4     John  28.0    50000.0   2018-01-15      Sales
4    5      Eve  29.0   148700.0   2018-05-12    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
6    7      NaN  32.0    61000.0   2020-06-20      Sales
7    8     Dave  30.3    52000.0   2021-02-14        NaN
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [31]:
df=df.dropna(subset=["Department"])

In [32]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
3    4     John  28.0    50000.0   2018-01-15      Sales
4    5      Eve  29.0   148700.0   2018-05-12    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
6    7      NaN  32.0    61000.0   2020-06-20      Sales
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [33]:
df=df.dropna(subset=["Name"])

In [34]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
3    4     John  28.0    50000.0   2018-01-15      Sales
4    5      Eve  29.0   148700.0   2018-05-12    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [35]:
df = df.drop_duplicates()

In [36]:
df = df.drop_duplicates(subset=["Name", "Age", "Salary", "Joining_Date", "Department"])

In [37]:
df

    ID     Name   Age     Salary Joining_Date Department
0    1     John  28.0    50000.0   2018-01-15      Sales
1    2    Alice  30.3    62000.0   2019-03-22         HR
2    3      Bob  35.0    58000.0   2017-07-30      Sales
4    5      Eve  29.0   148700.0   2018-05-12    Finance
5    6  Charlie  25.0    45000.0   2019-12-01         IT
8    9    Alice  30.0    62000.0   2019-03-22         HR
9   10      Eve  29.0  1000000.0   2018-05-12    Finance
10  11    Frank  40.0   148700.0   2016-08-19         IT
11  12    Grace  27.0    47000.0   2022-09-25    Support

In [38]:
df =df.reset_index(drop=True)

In [39]:
df

   ID     Name   Age     Salary Joining_Date Department
0   1     John  28.0    50000.0   2018-01-15      Sales
1   2    Alice  30.3    62000.0   2019-03-22         HR
2   3      Bob  35.0    58000.0   2017-07-30      Sales
3   5      Eve  29.0   148700.0   2018-05-12    Finance
4   6  Charlie  25.0    45000.0   2019-12-01         IT
5   9    Alice  30.0    62000.0   2019-03-22         HR
6  10      Eve  29.0  1000000.0   2018-05-12    Finance
7  11    Frank  40.0   148700.0   2016-08-19         IT
8  12    Grace  27.0    47000.0   2022-09-25    Support

In [40]:
df=df.drop_duplicates(subset=["Name"])

In [41]:
df=df.reset_index(drop=True)

In [42]:
df["Age"]

0    28.0
1    30.3
2    35.0
3    29.0
4    25.0
5    40.0
6    27.0
Name: Age, dtype: float64

In [43]:
df["Age"]= [28.0,30.3,35.7,29.0,32.0,40.9,25.0]

In [44]:
df

   ID     Name   Age    Salary Joining_Date Department
0   1     John  28.0   50000.0   2018-01-15      Sales
1   2    Alice  30.3   62000.0   2019-03-22         HR
2   3      Bob  35.7   58000.0   2017-07-30      Sales
3   5      Eve  29.0  148700.0   2018-05-12    Finance
4   6  Charlie  32.0   45000.0   2019-12-01         IT
5  11    Frank  40.9  148700.0   2016-08-19         IT
6  12    Grace  25.0   47000.0   2022-09-25    Support

In [45]:
df.loc[df["Name"]=="John","Age"] = 28.6

In [46]:
df["Age"]=df["Age"].astype(int)

In [47]:
df

   ID     Name  Age    Salary Joining_Date Department
0   1     John   28   50000.0   2018-01-15      Sales
1   2    Alice   30   62000.0   2019-03-22         HR
2   3      Bob   35   58000.0   2017-07-30      Sales
3   5      Eve   29  148700.0   2018-05-12    Finance
4   6  Charlie   32   45000.0   2019-12-01         IT
5  11    Frank   40  148700.0   2016-08-19         IT
6  12    Grace   25   47000.0   2022-09-25    Support

In [48]:
pip install scipy

Requirement already satisfied: scipy in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (1.15.3)
Requirement already satisfied: numpy<2.5,>=1.23.5 in c:\users\abhishek\appdata\local\programs\python\python310\lib\site-packages (from scipy) (2.2.6)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.3 is available.
You should consider upgrading via the 'c:\Users\Abhishek\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [49]:
# from scipy import stats
# import numpy as np

# z = np.abs(stats.zscore(df["Salary"]))
# print(z)   # Z-scores
# outliers = df[z > 3]  # Z > 3 means outlier

In [50]:
# Q1 = df["Salary"].quantile(0.25)
# Q3 = df["Salary"].quantile(0.75)
# IQR = Q3 - Q1

# lower = Q1 - 1.5 * IQR
# upper = Q3 + 1.5 * IQR

# outliers = df[(df["Salary"] < lower) | (df["Salary"] > upper)]
# print(outliers)

In [51]:
# median_salary = df["Salary"].median()
# df.loc[df["Salary"] > upper, "Salary"] = median_salary

In [52]:
salary_mean = df['Salary'].mean()
salary_std = df['Salary'].std()
lower_bound = salary_mean - (3 * salary_std)
upper_bound = salary_mean + (3 * salary_std)

In [53]:
df = df[(df["Salary"] >= lower_bound) & (df["Salary"] <= upper_bound )]

In [54]:
df

   ID     Name  Age    Salary Joining_Date Department
0   1     John   28   50000.0   2018-01-15      Sales
1   2    Alice   30   62000.0   2019-03-22         HR
2   3      Bob   35   58000.0   2017-07-30      Sales
3   5      Eve   29  148700.0   2018-05-12    Finance
4   6  Charlie   32   45000.0   2019-12-01         IT
5  11    Frank   40  148700.0   2016-08-19         IT
6  12    Grace   25   47000.0   2022-09-25    Support